{
      "architectures": ["LukeForEntityClassification"],
      "attention_probs_dropout_prob": 0.1,
      "bos_token_id": 0,
      "entity_emb_size": 256,
      "entity_vocab_size": 500000,
      "eos_token_id": 2,
      "gradient_checkpointing": false,
      "hidden_act": "gelu",
      "hidden_dropout_prob": 0.1,
      "hidden_size": 1024,
      "id2label": {
          "0": "/art",
          "1": "/art/film",
          "2": "/astral_body",
          "3": "/award",
          "4": "/biology",
          "5": "/body_part",
          "6": "/broadcast",
          "7": "/broadcast/tv_channel",
          "8": "/broadcast_network",
          "9": "/broadcast_program",
          "10": "/building",
          "11": "/building/airport",
          "12": "/building/hospital",
          "13": "/building/library",
          "14": "/building/restaurant",
          "15": "/building/sports_facility",
          "16": "/building/theater",
          "17": "/chemistry",
          "18": "/computer",
          "19": "/computer/programming_language",
          "20": "/disease",
          "21": "/education",
          "22": "/education/department",
          "23": "/education/educational_degree",
          "24": "/event",
          "25": "/event/attack",
          "26": "/event/election",
          "27": "/event/military_conflict",
          "28": "/event/natural_disaster",
          "29": "/event/protest",
          "30": "/event/sports_event",
          "31": "/finance",
          "32": "/finance/currency",
          "33": "/food",
          "34": "/game",
          "35": "/geography",
          "36": "/geography/island",
          "37": "/geography/mountain",
          "38": "/god",
          "39": "/government",
          "40": "/government/government",
          "41": "/government/political_party",
          "42": "/government_agency",
          "43": "/internet",
          "44": "/internet/website",
          "45": "/language",
          "46": "/law",
          "47": "/livingthing",
          "48": "/livingthing/animal",
          "49": "/location",
          "50": "/location/body_of_water",
          "51": "/location/bridge",
          "52": "/location/cemetery",
          "53": "/location/city",
          "54": "/location/country",
          "55": "/location/county",
          "56": "/location/province",
          "57": "/medicine",
          "58": "/medicine/drug",
          "59": "/medicine/medical_treatment",
          "60": "/medicine/symptom",
          "61": "/metropolitan_transit",
          "62": "/metropolitan_transit/transit_line",
          "63": "/military",
          "64": "/music",
          "65": "/news_agency",
          "66": "/organization",
          "67": "/organization/airline",
          "68": "/organization/company",
          "69": "/organization/educational_institution",
          "70": "/organization/fraternity_sorority",
          "71": "/organization/sports_league",
          "72": "/organization/sports_team",
          "73": "/park",
          "74": "/people",
          "75": "/people/ethnicity",
          "76": "/person",
          "77": "/person/actor",
          "78": "/person/architect",
          "79": "/person/artist",
          "80": "/person/athlete",
          "81": "/person/author",
          "82": "/person/coach",
          "83": "/person/director",
          "84": "/person/doctor",
          "85": "/person/engineer",
          "86": "/person/monarch",
          "87": "/person/musician",
          "88": "/person/politician",
          "89": "/person/religious_leader",
          "90": "/person/soldier",
          "91": "/play",
          "92": "/product",
          "93": "/product/airplane",
          "94": "/product/car",
          "95": "/product/computer",
          "96": "/product/instrument",
          "97": "/product/ship",
          "98": "/product/spacecraft",
          "99": "/product/weapon",
          "100": "/rail",
          "101": "/rail/railway",
          "102": "/religion",
          "103": "/religion/religion",
          "104": "/software",
          "105": "/time",
          "106": "/title",
          "107": "/train",
          "108": "/transit",
          "109": "/transportation",
          "110": "/transportation/road",
          "111": "/written_work"
      },
      "initializer_range": 0.02,
      "intermediate_size": 4096,
      "label2id": {
          "/art": 0,
          "/art/film": 1,
          "/astral_body": 2,
          "/award": 3,
          "/biology": 4,
          "/body_part": 5,
          "/broadcast": 6,
          "/broadcast/tv_channel": 7,
          "/broadcast_network": 8,
          "/broadcast_program": 9,
          "/building": 10,
          "/building/airport": 11,
          "/building/hospital": 12,
          "/building/library": 13,
          "/building/restaurant": 14,
          "/building/sports_facility": 15,
          "/building/theater": 16,
          "/chemistry": 17,
          "/computer": 18,
          "/computer/programming_language": 19,
          "/disease": 20,
          "/education": 21,
          "/education/department": 22,
          "/education/educational_degree": 23,
          "/event": 24,
          "/event/attack": 25,
          "/event/election": 26,
          "/event/military_conflict": 27,
          "/event/natural_disaster": 28,
          "/event/protest": 29,
          "/event/sports_event": 30,
          "/finance": 31,
          "/finance/currency": 32,
          "/food": 33,
          "/game": 34,
          "/geography": 35,
          "/geography/island": 36,
          "/geography/mountain": 37,
          "/god": 38,
          "/government": 39,
          "/government/government": 40,
          "/government/political_party": 41,
          "/government_agency": 42,
          "/internet": 43,
          "/internet/website": 44,
          "/language": 45,
          "/law": 46,
          "/livingthing": 47,
          "/livingthing/animal": 48,
          "/location": 49,
          "/location/body_of_water": 50,
          "/location/bridge": 51,
          "/location/cemetery": 52,
          "/location/city": 53,
          "/location/country": 54,
          "/location/county": 55,
          "/location/province": 56,
          "/medicine": 57,
          "/medicine/drug": 58,
          "/medicine/medical_treatment": 59,
          "/medicine/symptom": 60,
          "/metropolitan_transit": 61,
          "/metropolitan_transit/transit_line": 62,
          "/military": 63,
          "/music": 64,
          "/news_agency": 65,
          "/organization": 66,
          "/organization/airline": 67,
          "/organization/company": 68,
          "/organization/educational_institution": 69,
          "/organization/fraternity_sorority": 70,
          "/organization/sports_league": 71,
          "/organization/sports_team": 72,
          "/park": 73,
          "/people": 74,
          "/people/ethnicity": 75,
          "/person": 76,
          "/person/actor": 77,
          "/person/architect": 78,
          "/person/artist": 79,
          "/person/athlete": 80,
          "/person/author": 81,
          "/person/coach": 82,
          "/person/director": 83,
          "/person/doctor": 84,
          "/person/engineer": 85,
          "/person/monarch": 86,
          "/person/musician": 87,
          "/person/politician": 88,
          "/person/religious_leader": 89,
          "/person/soldier": 90,
          "/play": 91,
          "/product": 92,
          "/product/airplane": 93,
          "/product/car": 94,
          "/product/computer": 95,
          "/product/instrument": 96,
          "/product/ship": 97,
          "/product/spacecraft": 98,
          "/product/weapon": 99,
          "/rail": 100,
          "/rail/railway": 101,
          "/religion": 102,
          "/religion/religion": 103,
          "/software": 104,
          "/time": 105,
          "/title": 106,
          "/train": 107,
          "/transit": 108,
          "/transportation": 109,
          "/transportation/road": 110,
          "/written_work": 111
      },
      "layer_norm_eps": 1e-05,
      "max_position_embeddings": 514,
      "model_type": "luke",
      "num_hidden_layers": 24,
      "num_attention_heads": 16,
      "output_past": true,
      "pad_token_id": 1,
      "transformers_version": "4.18.0.dev0",
      "type_vocab_size": 1,
      "use_entity_aware_attention": true,
      "vocab_size": 50267
}

